app/controllers/application_controller.rb

    def current_user
      return unless decoded_token

      user_id = decoded_token[0]['user_id']
      User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]