app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("appointment_date", "doctor_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["appointment_date", "2021-08-01 00:00:00"], ["doctor_id", 1], ["created_at", "2021-08-11 20:24:32.446262"], ["updated_at", "2021-08-11 20:24:32.446262"], ["user_id", 3]]
---
  def create
    @appointment = current_user.appointments.build(appointment_params)

    if @appointment.save

DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 22]]
---
  def destroy
    @appointment.destroy

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ? AND "appointments"."id" = ? LIMIT ?  [["user_id", 15], ["id", 1], ["LIMIT", 1]]
---
  def find_appointment
    @appointment = current_user.appointments.find_by(id: params[:id])