app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = ?  [["user_id", 1]]
---
  def find_appointment
    @appointment = current_user.appointments.find_by(id: params[:id])