app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test_user"], ["password_digest", "[FILTERED]"], ["age", 35], ["created_at", "2024-09-01 14:11:00.103473"], ["updated_at", "2024-09-01 14:11:00.103473"]]
---
  def create
    user = User.new(user_params)
    if user.valid?
      user.save